/*	Copyright (c) 1990, 1991, 1992, 1993, 1994, 1995, 1996 Santa Cruz Operation, Inc. All Rights Reserved.	*/
/*	Copyright (c) 1988, 1990 AT&T, Inc. All Rights Reserved.	*/
/*	  All Rights Reserved  	*/

/*	THIS IS UNPUBLISHED PROPRIETARY SOURCE CODE OF Santa Cruz Operation, Inc.	*/
/*	The copyright notice above does not evidence any   	*/
/*	actual or intended publication of such source code.	*/

#ident	"@(#)size:common/main.c	1.15"
/* UNIX HEADERS */
#include	<stdio.h>
#include	<stdlib.h>
#include	<fcntl.h>
#include	<sys/stat.h>
#include	<sys/types.h>
#include	<string.h>
#include	<errno.h>
#include	<ar.h>
#include	<time.h>
#include	<unistd.h>

/* ELF HEADERS */
#include	"libelf.h"
#include	"sys/elf.h"

/* SIZE HEADER */
#include	"defs.h"
#include	"mytypes.h"

/* SIZE HEADER */
#include	"zlib.h"

#ifdef	__GNUC__
#define		PLU_PKG		"GNU C/C++ Compilation System Version "
#endif

#define		MKBIZ_VER	"v3.24"
#define		TEST_MKBIZ	0

#ifndef		O_BINARY
#define		O_BINARY	0
#endif

/* EXTERNAL VARIABLES DEFINED */
static int	errflag   =  0;	/* Global error flag							*/
int			pkg_flag  =  0;	/* Global bootrom+app package flag				*/
int			pkg_vers  =  2; /* Version of flash map package					*/
int			exitcode  =  0;	/* Global exit code								*/
char		*src_name =  0;	/* Source      file name pointer				*/
char		*bin_name =  0;	/* Destination file name: in binary format		*/
char		*sym_name =  0;	/* Destination file name: symbol table file		*/
char		*bi0_name =  0;	/* Destination file name: Even Words(bin)		*/
char		*bi1_name =  0;	/* Destination file name: Odd  Words(bin)		*/
char		*biz_name =  0;	/* Destination file name: in biz    			*/
char		*pkg_name =  0;	/* Source/Dest file name: Boot+App Package		*/
char		inf_str[256]="";/* Information string buffer					*/
int			is_biz	  =  1;	/* Produce output image as zipped format		*/
int			gap_size  =256;	/* Stop processing after gap is bigger than it	*/

ulong_t		elf_start =  0;	/* Start offset of current ELF file				*/
ulong_t		pgm_entry =  0;	/* Entry point of program						*/
ulong_t		mach_type =  0;	/* Machine type									*/
ulong_t		app_entry =  0;	/* Entry point of application program (V1 Only)	*/
ulong_t		va_base   = -1;	/* Virtual address base of program				*/
ulong_t		load_addr = -1;	/* Overrided load address of program			*/
ulong_t		store_adr =  0;	/* Store address for bootrom          (V2 Only)	*/
ulong_t		bss_size  =  0;	/* Size of bss section 				  (V2 Only) */
ulong_t		aux_opts  =  0; /* Additional data for debugging      (V2 Only)	*/
ulong_t		aux_data  =  0; /* Start position of aux data         (V2 Only) */

ulong_t		flash_siz =  0; /* Size of flash memory							*/
ulong_t		flash_swap=  0; /* Swap 16bit word or not 						*/
ulong_t		num_flash =  1;	/* Number of flash memory						*/
ulong_t		n_section =  1; /* Number of sections in flash map				*/
char		ic_str[2][64] = { "_Even", "_Odd"} ;	/* Tag name of IC		*/

ulong_t		verbose   =  0; /* Verbose message */

static char	*tool_name;		/* Command name of this tool					*/

static void	usagerr();
void		error();

extern int	close();
extern char	*strp;
extern Elf32_Phdr	*phdr;
extern Elf32_Shdr	*shdr;

#define OPTSTR  "a:bP:zg:l:o:s:?Vv"	/* option string for getopt			*/
#define OPTMSG  "abPzglos?Vv"			/* option string for help message	*/

/* Version Independant definitions											*/
#define BIZ_MAGIC		0xB12791EE

/* Version 1: Internal definition of size of bootrom for DInnQ82/DInnDZ11	*/
#define V1_C_RST_VEC	0x9fc00000	/*       Cached   Reset Vector for MIPS	*/
#define V1_U_RST_VEC	0xbfc00000	/*       Uncached Reset Vector for MIPS	*/

/* Internal map of flash memory will be defined in xxxx.pkg					*/
/* Version 1: DIxxQ82, DIxxFZ11												*/
/* Version 2: LST3100A, LST4200A, LCSET										*/

/* Internal variable to make header message of biz file						*/
#define	MAX_HDR_SIZE		4096
#define	NUM_HDR_ITEM		  10
#define	HDR_ALIGN			  16


uchar_t    	bin_buff[MAX_BIN_SIZE];		/* Buffer for binary file			*/
ulong_t		sym_hash[MAX_SYM_COUNT];	/* String hash table				*/
long		sym_tabs[MAX_SYM_COUNT][3];	/* Buffer for symbol table			*/
char		sym_buff[MAX_SYM_BUFF];		/* Buffer for symbol list			*/
int			nTxtSyms = 0;				/* Number of function symbols		*/
int			nSbSize  = 0;				/* Size of symbol list				*/


char		versionBuf[MAX_VER_LEN];	/* Buffer space for version			*/
char		tmStampBuf[MAX_VER_LEN];	/* Buffer space for build time		*/

typedef struct
{
	char		*fm_name;		/* Name of section in flash map				*/
	char		fm_mode;		/* Exact size match mode of this section	*/
	char		fm_fill;		/* Fill pattern for remain area				*/
	ulong_t		fm_base;		/* Base address of this section				*/
	ulong_t		fm_bsiz;		/* Size of this binary section				*/
	ulong_t		fm_zbas;		/* Base address of 							*/
	ulong_t		fm_zsiz;		/* Size of this compressed section			*/
	char		*fm_data;		/* Data to be filled						*/
} FlashMap_t;


/*
 *	Default map for single image
 *	Map_V1 for DIxxQ82, DIxx28FZ11
 *	Map_V2 for LST3100A, LST4200A, LCSET
 */
FlashMap_t	defFlashMap[] = { { "Executable", 0, 0xff, 0x000000, MAX_BIN_SIZE, 0, 0, NULL },
							  { "",           0, 0xff, 0x000000, 0x000000,     0, 0, NULL },
							  { "",           0, 0xff, 0x000000, 0x000000,     0, 0, NULL },
							  { "",           0, 0xff, 0x000000, 0x000000,     0, 0, NULL },
							  { "",           0, 0xff, 0x000000, 0x000000,     0, 0, NULL } };

#define	USE_OLD_DATE_INFO	0
/*
 *	Do not change Header Format, it will be used in bootrom.
 *	If changed, it should be applied to bootrom source.
 *	First three lines are for checking download start and end condition.
 */
char	Header[MAX_HDR_SIZE] = { 0, };

char	v1_HeaderFormat[]	=			// For DInnQ82
			"%c%c"						// Tag 0,1(GZIP Magic)
			"HeadSize=0x%08X\r\n"		// Tag   2
			"GzipSize=0x%08X\r\n"		// Tag	 3
			"FileSize=0x%08X\r\n"		// Tag	 4
			"LoadAddr=0x%08x\r\n"		// Tag	 5
			"BuildDate=%24.24s\r\n"		// Tag	 6
			"Builder=%s\r\n"			// Tag	 7
			"Version=%s\r\n"			// Tag	 8
			"Comment=%s\r\n";			// Tag	 9

char	v2_HeaderFormat[]	=			// For Pallas
			"%c%c"						// Tag 0,1(GZIP Magic)
			"HeadSize=0x%08x\n"			// Tag   2
			"GzipSize=0x%08x\n"			// Tag   3
			"FileSize=0x%08x\n"			// Tag   4
			"Gzip_CRC=0x%08x\n"			// Tag   5
			"File_CRC=0x%08x\n"			// Tag   6
			"StartAdr=0x%08x\n"			// Tag   7
			"LoadAddr=0x%08x\n"			// Tag   8
			"StoreLoc=0x%08x\n"			// Tag   9
			"Aux_Data=0x%08x\n"			// Tag  10
			#if	USE_OLD_DATE_INFO
			"BuildDate=%-24.24s\n"		// Tag  11
			#else
			"BuildDate=%s\n"			// Tag  11
			#endif	/* OLD_DATE_INFO */
			"Builder=%s\n"				// Tag  12
			"Version=%s\n"				// Tag  13
			"Comment=%s, by mkbiz %s\n"	// Tag  14
			"\n\n\n\n";

char	*marker1 = (char *)"ffffffff";
char	*marker2 = (char *)"FFFFFFFF";


/*
 * Definition for bizinfo in bootrom
 */

#define	NAME_SZ			64				// Size of named strings
#define	NOTE_SZ		(NAME_SZ*3)			// Size of comment strings
#define	LW_256			64				// Long words in 256 bytes
#define	LW_768			192				// Long words in 768 bytes
#define	LW_1K			256				// Long words in 1K  bytes

/*--------------------------------------------------------------------------*/
/*	DInnQ82:	Information field for BIZ File [ 2K bytes ]					*/
/*--------------------------------------------------------------------------*/
typedef struct {
  long	biz_fsize;				/* 0x000: Size of Zipped bin file			*/
  long	biz_magic;				/* 0x004: Magic number(BIZ_MAGIC)			*/
  long	biz_dstamp;				/* 0x008: Incremental Download Stamp 		*/
  long	biz_protect;			/* 0x00C: Write protection for longer save	*/
  long  biz_gzcrc;				/* 0x010: CRC32 of Zipped bin file			*/
  long  biz_osize;				/* 0x014: Size of unzipped image file		*/
  long  biz_hsize;              /* 0x018: Size of transmission header		*/
  long  biz_laddr;              /* 0x01C: Load address of Unzipped image	*/
  long	biz_pad1[LW_256-8];		/* 0x020: Extenstion for primary header		*/

  /*		Next field must start  0x100									*/
  char	biz_build_date[NAME_SZ];/* 0x100: Date Time Stamp for build date	*/
  char	biz_load_date[NAME_SZ];	/* 0x140: Date Time Stamp for download date	*/
								/*        Not usable: Need RTC support		*/
  char	biz_version[NAME_SZ];	/* 0x180: Version of Executable code		*/
  char	biz_company[NAME_SZ];	/* 0x1C0: Company name of provider			*/
  char	biz_builder[NAME_SZ];	/* 0x200: Name of program builder			*/
  char	biz_comment[NOTE_SZ];	/* 0x240: Description of this program 		*/
  long	biz_pad2[LW_768-8*16];	/* 0x300: Extension for secondary header	*/

  /*		Next field must start  0x400									*/
  long	biz_pad3[LW_1K-3];		/* 0x400: Reserved for Future Extensions	*/
  ulong_t	bReverted;			/* 0x7F4: Revert information flag           */
  ulong_t	vReverted;			/* 0x7F8: Reverted Version Information		*/
  ulong_t	biz_crc32;			/* 0x7FC: Crc32 of Header for Sanity Check	*/
} V1BizInfo_t;

/*--------------------------------------------------------------------------*/
/*	Pallas:		Information field for BIZ File [ 2K bytes ]					*/
/*--------------------------------------------------------------------------*/
typedef struct BizInfo {
  long	biz_magic;				/* 0x000: Magic number(BIZ_MAGIC)			*/
  long  biz_hsize;              /* 0x004: Size of transmission header		*/
  long	biz_gzsiz;				/* 0x008: Size of Zipped bin file			*/
  long  biz_gzcrc;				/* 0x00c: CRC32 of Zipped bin file			*/
  long  biz_bisiz;				/* 0x010: Size of unzipped image file		*/
  long  biz_bicrc;				/* 0x014: CRC32 of Zipped bin file			*/
  long  biz_saddr;              /* 0x018: Start vector of Unzipped image	*/
  long  biz_laddr;              /* 0x01C: Load address of Unzipped image	*/
  long  biz_adata;              /* 0x020: Auxillary data for debugging		*/
  long	biz_dstamp;				/* 0x024: Incremental Download Stamp 		*/
  long	biz_protect;			/* 0x028: Write protection for longer save	*/
  long	biz_mvmem;				/* 0x02c: Memory movement factor 			*/
  long	biz_pad1[LW_256-12];	/* 0x030: Extenstion for primary header		*/

  /*		Next field must start  0x100									*/
  char	biz_build_date[NAME_SZ];/* 0x100: Date Time Stamp for build date	*/
  char	biz_load_date[NAME_SZ];	/* 0x140: Date Time Stamp for download date	*/
								/*        Not usable: Need RTC support		*/
  char	biz_version[NAME_SZ];	/* 0x180: Version of Executable code		*/
  char	biz_company[NAME_SZ];	/* 0x1C0: Company name of provider			*/
  char	biz_builder[NAME_SZ];	/* 0x200: Name of program builder			*/
  char	biz_comment[NOTE_SZ];	/* 0x240: Description of this program 		*/
  long	biz_pad2[LW_768-8*16];	/* 0x300: Extension for secondary header	*/

  /*		Next field must start  0x400									*/
  long	biz_pad3[LW_1K-3];		/* 0x400: Reserved for Future Extensions	*/
  ulong_t	bReverted;			/* 0x7F4: Revert information flag           */
  ulong_t	vReverted;			/* 0x7F8: Reverted Version Information		*/
  ulong_t	biz_crc32;			/* 0x7FC: Crc32 of Header for Sanity Check	*/
} V2BizInfo_t;


/*--------------------------------------------------------------------------*/
/*	calccrc32()																*/
/*		calculate crc32 value for validity check							*/
/*--------------------------------------------------------------------------*/
unsigned long calccrc32(unsigned char *buf, int len)
{
	#define CRC32_POLY 0x04c11db7     /* AUTODIN II, Ethernet, & FDDI */
	static unsigned long	crc32_table[256];
	unsigned char			*p;
	unsigned long			crc, c;
	int						i, j;

	if (!crc32_table[1])						/* if not already done, */
	{
		for (i = 0; i < 256; ++i) {
			for (c = i << 24, j = 8; j > 0; --j)
				c = c & 0x80000000 ? (c << 1) ^ CRC32_POLY : (c << 1);
				crc32_table[i] = c;
		}
	}

	crc = 0xffffffff;       /* preload shift register, per CRC-32 spec */
	for (p = buf; len > 0; ++p, --len)
		crc = (crc << 8) ^ crc32_table[(crc >> 24) ^ *p];
	return(crc);
}

